/* automatically generated by rust-bindgen 0.72.1 */

#[repr(i32)]
#[must_use]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum DltReturnValue {
    DLT_RETURN_FILESZERR = -8,
    DLT_RETURN_LOGGING_DISABLED = -7,
    DLT_RETURN_USER_BUFFER_FULL = -6,
    DLT_RETURN_WRONG_PARAMETER = -5,
    DLT_RETURN_BUFFER_FULL = -4,
    DLT_RETURN_PIPE_FULL = -3,
    DLT_RETURN_PIPE_ERROR = -2,
    DLT_RETURN_ERROR = -1,
    DLT_RETURN_OK = 0,
    DLT_RETURN_TRUE = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum DltLogLevelType {
    DLT_LOG_DEFAULT = -1,
    DLT_LOG_OFF = 0,
    DLT_LOG_FATAL = 1,
    DLT_LOG_ERROR = 2,
    DLT_LOG_WARN = 3,
    DLT_LOG_INFO = 4,
    DLT_LOG_DEBUG = 5,
    DLT_LOG_VERBOSE = 6,
    DLT_LOG_MAX = 7,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DltContext {
    pub contextID: [::std::os::raw::c_char; 4usize],
    pub log_level_pos: i32,
    pub log_level_ptr: *mut i8,
    pub trace_status_ptr: *mut i8,
    pub mcnt: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DltContext"][::std::mem::size_of::<DltContext>() - 32usize];
    ["Alignment of DltContext"][::std::mem::align_of::<DltContext>() - 8usize];
    ["Offset of field: DltContext::contextID"]
        [::std::mem::offset_of!(DltContext, contextID) - 0usize];
    ["Offset of field: DltContext::log_level_pos"]
        [::std::mem::offset_of!(DltContext, log_level_pos) - 4usize];
    ["Offset of field: DltContext::log_level_ptr"]
        [::std::mem::offset_of!(DltContext, log_level_ptr) - 8usize];
    ["Offset of field: DltContext::trace_status_ptr"]
        [::std::mem::offset_of!(DltContext, trace_status_ptr) - 16usize];
    ["Offset of field: DltContext::mcnt"][::std::mem::offset_of!(DltContext, mcnt) - 24usize];
};
impl Default for DltContext {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[must_use]
    pub fn dlt_register_app(
        apid: *const ::std::os::raw::c_char,
        description: *const ::std::os::raw::c_char,
    ) -> DltReturnValue;
}
unsafe extern "C" {
    #[must_use]
    pub fn dlt_unregister_app() -> DltReturnValue;
}
unsafe extern "C" {
    #[must_use]
    pub fn dlt_register_context(
        handle: *mut DltContext,
        contextid: *const ::std::os::raw::c_char,
        description: *const ::std::os::raw::c_char,
    ) -> DltReturnValue;
}
unsafe extern "C" {
    #[must_use]
    pub fn dlt_unregister_context(handle: *mut DltContext) -> DltReturnValue;
}
unsafe extern "C" {
    #[must_use]
    pub fn dlt_log_string(
        handle: *mut DltContext,
        loglevel: DltLogLevelType,
        text: *const ::std::os::raw::c_char,
    ) -> DltReturnValue;
}
